Bureau/GossipV3-master/app/views/static_pages/eachGossips.html.erb

<div id="mmm">
<p>Auteur: <%= @gossip.user.first_name %></p>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]