Bureau/GossipV3-master/app/views/users/new.html.erb

  <select class="field-tag form-item select-tag" name="city">
  <% City.all.each do |city| %>
---
SELECT "cities".* FROM "cities"