Bureau/GossipV3-master/app/controllers/gossips_controller.rb

SELECT "gossips".* FROM "gossips"
---
	def index
		if
		@gossips = Gossip.all

SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 28], ["LIMIT", 1]]
UPDATE "gossips" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "gossips"."id" = $4  [["title", "gusgus"], ["content", "gusgus"], ["updated_at", "2021-02-11 22:36:34.926798"], ["id", 28]]
---
	def update
		@gossip = Gossip.find(params[:id])
		post_params = params.require(:gossip).permit(:title, :content)
		@gossip.update(post_params)

INSERT INTO "gossips" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2021-02-11 22:45:16.684614"], ["updated_at", "2021-02-11 22:45:16.684614"]]
---
	def create
		post_params= params.require(:gossip).permit(title:params[:title], content:params[:content])
		@gossip = Gossip.create(post_params)