Bureau/GossipV3-master/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "gustavevilgot@gmail.com"], ["LIMIT", 1]]
---
	def create
 		# cherche s'il existe un utilisateur en base avec l’e-mail
  		user = User.find_by(email: params[:email])