Bureau/GossipV3-master/app/controllers/static_pages_controller.rb

  def home
  	@gossips = Gossip.all
---
SELECT "gossips"."id" FROM "gossips"

  def eachGossips
  	@gossip = Gossip.find(params[:id])
---
SELECT  "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]