Bureau/GossipV3-master/app/controllers/users_controller.rb

	def create

		User.create(email: params[:email],first_name:params[:first_name], password:params[:password])
---
INSERT INTO "users" ("first_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"